artillery_script/socket.io_chat.yml
config:
  target: 'http://localhost:3000/'
  socketio:
    transports: ['websocket']
  http:
    defaults:
      headers:
        cookie: 'authorization=Bearer%20eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOjEsImlhdCI6MTcxMzUwODAyNywiZXhwIjoxNzU2NzA4MDI3fQ.M8ox-UNjZ7vsgCY86XW0VUn-TWcT3JyiOXDKS8pTLAI'
  processor: './function/createUserId.js'
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 2
      name: 'ramp up'
    - duration: 60
      arrivalRate: 3
      name: 'spike load'

scenarios:
  - engine: 'socketio'
    beforeRequest: 'assignUserId'
    flow:
      - emit:
          channel: 'join'
          data:
            roomId: 35
            channelType: 'trials' # 추가된 부분
      - loop:
          - emit:
              channel: 'createChat'
              data:
                roomId: 35
                message: 'Message number {{ $randomNumber(1, 10000) }}'
                channelType: 'trials' # 추가된 부분
          - think: 1
        count: 120
      - emit:
          channel: 'leaveRoom'
          data:
            roomId: 35
            userId: '{{ userId }}'
            channelType: 'trials' # 추가된 부분